from lf_user_cluster.telegram_channel import inference as telegram_channel_inference
import pandas as pd


def telegram_channel():
    data = [
        {
            'record_id': '1004375611',
            'posts': [
                'مبارک باد زیبا مبعثش \n که با اقرا بسم ربک اغاز \n و با انااعطیناک الکوثربیمه \n وباالیوم اکملت لکم الدین جاودانه شد \n نغمه جاءالحق درتمام عالم طنین افکند \n🎊 عید مبعث مبارک 🎊\n🌹\n نهادامامت جمعه \n ',
                '🍂🍁🍂🍁🍂🍁🍂🍁🍂🍁\n دنیای غرب از دوچیز هراس دارند : اول محور \n مقاومت است . دوم موج بیداری \n است .\n که کانون این دو را در جمهوری اسلامی می بینند برای همین برنامه ایران هراسی راه انداختند در سوریه و عراق و کشورهای \n اسلامی جنگ خانمان سوزی ایجاد کردند تا مقاومت و موج بیداری اسلامی را ازبین ببرند خصوصا شیعه و جبهه مقاومت را درهم بکوبند .\n فجایعی که در همین چندماه اخیر با برنامه استکبار با محوریت عربستان سعودی در جهان اسلام رخ داده است از فاجعه منا گرفته \n تا تهاجم ناجوانمردانه به کشور یمن و امروز هم گستراندن دامنه این خشونت و ناامنی به نیجریه و قتل عام بیش از پانصد نفر از \n شیعیان مظلوم ان کشور و کشتار شیعیان برخی از مناطق پاکستان و اذربایجان در کنار جنایتهای سوریه و عراق در همین مدت کوتاه \n در چند ده هزار نفر از مسلمانان مظلوم را به خاک و خون کشیدند .\n مجامع بین المللی تا کی باید بخاطر ملاحظات مادی و مالی منافع استکباری خود در برابر این ناجوانمردی ها سکوت اختیار کنند ،\n حتی رسانه های زنجیره ای کشور ما و برخی از مسئولین ما ، از جمله رییس جمهور در قبا...'
            ]
        }
    ]

    assert telegram_channel_inference(pd.DataFrame(data)).iloc[0]["group"] == [39, 65]
